In [1]:
import numpy as np
import pandas as pd
import os

In [2]:
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)

df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

DataFrame 中的每一列都是一个 Series (Each column in a DataFrame is a Series)

In [3]:
df['Name']

0     Braund, Mr. Owen Harris
1    Allen, Mr. William Henry
2    Bonnell, Miss. Elizabeth
Name: Name, dtype: object

In [4]:
df['Age']

0    22
1    35
2    58
Name: Age, dtype: int64

In [5]:
ages = pd.Series([22,24,35],name='Age')
ages

0    22
1    24
2    35
Name: Age, dtype: int64

pandas Series 没有列标签，因为它只是 DataFrame 的单列。Series有行标签。

总结1

REMEMBER  记得
Import the package, aka import pandas as pd
导入包，又名导入 pandas 作为 pd

A table of data is stored as a pandas DataFrame
数据表存储为 pandas DataFrame

Each column in a DataFrame is a Series
DataFrame 中的每一列都是一个 Series

You can do things by applying a method to a DataFrame or Series
您可以通过将方法应用于 DataFrame 或 Series 来执行

How do I read and write tabular data?
如何读取和写入表格数据？

In [6]:
titanic = pd.read_excel("C:/Users/30264/Downloads/体检数据.xlsx")

In [7]:
titanic

   学号  姓名   身高  体重   肺活量
0   1  小明  168  60  3200
1   2  小黄  187  80  3800
2   3  小花  170  70  3400

In [8]:
with open('D:/test/test720/pd_test1.csv','w')as f:
    f.write('a,b,c,d\n')
    f.write('A,B,C,D\n')
df = pd.read_csv('D:/test/test720/pd_test1.csv')
df

   a  b  c  d
0  A  B  C  D

pandas 提供 read_csv（） 函数，用于将存储为 csv 文件的数据读取到 pandas DataFrame 中

In [9]:
titanic.head(2)

   学号  姓名   身高  体重   肺活量
0   1  小明  168  60  3200
1   2  小黄  187  80  3800

查看前两行

In [10]:
titanic.tail(1)

   学号  姓名   身高  体重   肺活量
2   3  小花  170  70  3400

查看最后一行

In [11]:
titanic.dtypes

学号      int64
姓名     object
身高      int64
体重      int64
肺活量     int64
dtype: object

In [12]:
titanic['身高'].dtypes

dtype('int64')

In [13]:
df.to_excel("df.xlsx", sheet_name="df", index=False)
df

   a  b  c  d
0  A  B  C  D

In [14]:
df = pd.read_excel("df.xlsx")
df

   a  b  c  d
0  A  B  C  D

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       1 non-null      object
 1   b       1 non-null      object
 2   c       1 non-null      object
 3   d       1 non-null      object
dtypes: object(4)
memory usage: 164.0+ bytes

总结2

REMEMBER  记得
Getting data in to pandas from many different file formats or data sources is supported by read_* functions.
read_* 函数支持从许多不同的文件格式或数据源将数据导入 pandas。

Exporting data out of pandas is provided by different to_*methods.
从 pandas 中导出数据由不同的 to_* 方法。

The head/tail/info methods and the dtypes attribute are convenient for a first check.
head/tail/info 方法和 dtypes 属性便于进行第一次检查。

How do I select a subset of a DataFrame?
如何选择 DataFrame 的子集？#

In [16]:
titanic = pd.read_csv(r"D:\titanic.csv")
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [17]:
age = titanic['Age']
age.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [18]:
type(titanic["Age"])

pandas.core.series.Series

In [19]:
age.shape

(891,)

DataFrame.shape 是 pandas Series 和 DataFrame 的一个属性，其中包含行数和列数：（nrows， ncolumns）。
pandas Series 是一维的，只返回行数。

In [26]:
age_sex = titanic[['Age','Sex']]
age_sex

      Age     Sex
0    22.0    male
1    38.0  female
2    26.0  female
3    35.0  female
4    35.0    male
..    ...     ...
886  27.0    male
887  19.0  female
888   NaN  female
889  26.0    male
890  32.0    male

[891 rows x 2 columns]

To select multiple columns, use a list of column names within the selection brackets [].
要选择多个列，请使用选择方括号 [] 内的列名称列表。
Note  注意
内部方括号定义 Python 列表 ，而 外括号用于从 pandas 中选择数据 DataFrame 的实例。

In [25]:
type(age_sex),age_sex.shape

(pandas.core.frame.DataFrame, (891, 2))

How do I filter specific rows from a DataFrame?
如何从 DataFrame 中过滤特定行？

In [34]:
# To select rows based on a conditional expression, use a condition inside the selection brackets [].
# 要根据条件表达式选择行，请在选择方括号 [] 内使用条件。
print(titanic['Age']>35)
above_35 = titanic[titanic['Age']>35]
print(above_35)

0      False
1       True
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool
     PassengerId  Survived  Pclass  \
1              2         1       1
6              7         0       1
11            12         1       1
13            14         0       3
15            16         1       2
..           ...       ...     ...
865          866         1       2
871          872         1       1
873          874         0       3
879          880         1       1
885          886         0       3

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
6                              McCarthy, Mr. Timothy J    male  54.0      0
11                             Bonnell, Miss Elizabeth  female  58.0      0
13                         Andersson, Mr. Anders Johan    male  39.0      1
15                    Hewlett, Mrs. (Mary D Kingcome)   female  55.0      0
..                                                 ...     ...   ...    ...
865                           Bystrom, Mrs. (Karolina)  female  42.0      0
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
873                        Vander Cruyssen, Mr. Victor    male  47.0      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0

     Parch    Ticket     Fare Cabin Embarked
1        0  PC 17599  71.2833   C85        C
6        0     17463  51.8625   E46        S
11       0    113783  26.5500  C103        S
13       5    347082  31.2750   NaN        S
15       0    248706  16.0000   NaN        S
..     ...       ...      ...   ...      ...
865      0    236852  13.0000   NaN        S
871      1     11751  52.5542   D35        S
873      0    345765   9.0000   NaN        S
879      1     11767  83.1583   C50        C
885      5    382652  29.1250   NaN        Q

[217 rows x 12 columns]